#+TITLE: Software Defined Communication System
#+AUTHOR: Adithya Nair
#+LATEX_HEADER: \input{preamble}
#+LATEX_CLASS: report

* Unit 1
** Convolutions
\begin{definition}[Convolution]
A convolution is an integral that expresses the amount of overlap of one function $f(t)$, as it is shifted over to function $g(t)$, for a continuous time signal.
\[
(f * g)(t) = \int_{-\infty}^{\infty} f(\tau)g(t - \tau) d \tau
\]
\end{definition}
When working with discrete signals, the integral becomes a summation.
So the convolution $Y[h] $
\[
Y[h] = \Sum_{k = -\infty}^{\infty} x(k) h(n-k)
\]
#+begin_src octave :results output
h = [0 1 2 3;2 4 1 3]';
reverse = @(H)[-1*H(:,1) H(:,2)];
timeRH = reverse(h)
#+end_src

#+RESULTS:
: timeRH =
:
:    0   2
:   -1   4
:   -2   1
:   -3   3
:
